[ { "id": 156, "joke": "There is no such thing as global warming. Chuck Norris was cold, so he turned the sun up.", "categories": [] }, { "id": 360, "joke": "Two wrongs don't make a right. Unless you're Chuck Norris. Then two wrongs make a roundhouse kick to the face.", "categories": [] }, { "id": 162, "joke": "Once you go Norris, you are physically unable to go back.", "categories": [] }, { "id": 380, "joke": "Chuck Norris does not follow fashion trends, they follow him. But then he turns around and kicks their ass. Nobody follows Chuck Norris.", "categories": [] }, { "id": 91, "joke": "When taking the SAT, write &quot;Chuck Norris&quot; for every answer. You will score over 8000.", "categories": [] }, { "id": 100, "joke": "Chuck Norris grinds his coffee with his teeth and boils the water with his own rage.", "categories": [] }, { "id": 183, "joke": "Chuck Norris invented a language that incorporates karate and roundhouse kicks. So next time Chuck Norris is kicking your ass, don?t be offended or hurt, he may be just trying to tell you he likes your hat.", "categories": [] }, { "id": 562, "joke": "How many Chuck Norris require to screw a light bulb? None, he will screw it all.", "categories": [] }, { "id": 272, "joke": "Chuck Norris can taste lies.", "categories": [] }, { "id": 430, "joke": "Chuck Norris does not wear a condom. Because there is no such thing as protection from Chuck Norris.", "categories": [] }, { "id": 543, "joke": "Chuck Norris's programs can pass the Turing Test by staring at the interrogator.", "categories": ["nerdy"] }, { "id": 439, "joke": "Chuck Norris can kick through all 6 degrees of separation, hitting anyone, anywhere, in the face, at any time.", "categories": [] }, { "id": 256, "joke": "How many roundhouse kicks does it take to get to the center of a tootsie pop? Just one. From Chuck Norris.", "categories": [] }, { "id": 201, "joke": "Chuck Norris was what Willis was talkin' about.", "categories": [] }, { "id": 280, "joke": "When Chuck Norris works out on the Total Gym, the Total Gym feels like it's been raped.", "categories": [] }, { "id": 126, "joke": "When Chuck Norris does a pushup, he isn't lifting himself up, he's pushing the Earth down.", "categories": [] }, { "id": 172, "joke": "Some kids play Kick the can. Chuck Norris played Kick the keg.", "categories": [] }, { "id": 289, "joke": "Chuck Norris has never been in a fight, ever. Do you call one roundhouse kick to the face a fight?", "categories": [] }, { "id": 608, "joke": "Chuck Norris can stand on his head. His dick-head.", "categories": ["explicit"] }, { "id": 137, "joke": "Tom Clancy has to pay royalties to Chuck Norris because &quot;The Sum of All Fears&quot; is the name of Chuck Norris' autobiography.", "categories": [] }, { "id": 34, "joke": "The opening scene of the movie &quot;Saving Private Ryan&quot; is loosely based on games of dodgeball Chuck Norris played in second grade.", "categories": [] }, { "id": 399, "joke": "In the movie &quot;The Matrix&quot;, Chuck Norris is the Matrix. If you pay close attention in the green &quot;falling code&quot; scenes, you can make out the faint texture of his beard.", "categories": [] }, { "id": 336, "joke": "Chuck Norris uses tabasco sauce instead of visine.", "categories": [] }, { "id": 564, "joke": "Chuck Norris can download emails with his pick-up.", "categories": ["nerdy"] }, { "id": 262, "joke": "Chuck Norris used to play baseball. When Babe Ruth was hailed as the better player, Chuck Norris killed him with a baseball bat to the throat. Lou Gehrig got off easy.", "categories": [] }, { "id": 327, "joke": "Chuck Norris once ordered a steak in a restaurant. The steak did what it was told.", "categories": [] }, { "id": 500, "joke": "Chuck Norris can access the DB from the UI.", "categories": ["nerdy"] }, { "id": 136, "joke": "Chuck Norris does not own a stove, oven, or microwave , because revenge is a dish best served cold.", "categories": [] }, { "id": 223, "joke": "Chuck Norris smells what the Rock is cooking... because the Rock is Chuck Norris' personal chef.", "categories": [] }, { "id": 18, "joke": "According to the Encyclopedia Brittanica, the Native American &quot;Trail of Tears&quot; has been redefined as anywhere that Chuck Norris walks.", "categories": [] }, { "id": 489, "joke": "Chuck Norris can write multi-threaded applications with a single thread.", "categories": ["nerdy"] }, { "id": 438, "joke": "Chuck Norris likes his ice like he likes his skulls: crushed.", "categories": [] }, { "id": 376, "joke": "Chuck Norris doesn't daydream. He's too busy giving other people nightmares.", "categories": [] }, { "id": 195, "joke": "Chuck Norris wears a live rattlesnake as a condom.", "categories": [] }, { "id": 265, "joke": "The phrase 'balls to the wall' was originally conceived to describe Chuck Norris entering any building smaller than an aircraft hangar.", "categories": [] }, { "id": 179, "joke": "Chuck Norris? favourite cut of meat is the roundhouse.", "categories": [] }, { "id": 243, "joke": "Contrary to popular belief, the Titanic didn't hit an iceberg. The ship was off course and ran into Chuck Norris while he was doing the backstroke across the Atlantic.", "categories": [] }, { "id": 616, "joke": "Chuck Norris made the sun by rubbing his hands together.", "categories": [] }, { "id": 206, "joke": "Chuck Norris destroyed the periodic table, because Chuck Norris only recognizes the element of surprise.", "categories": [] }, { "id": 534, "joke": "Chuck Norris is the ultimate mutex, all threads fear him.", "categories": ["nerdy"] }, { "id": 41, "joke": "Chuck Norris doesn't wash his clothes. He disembowels them.", "categories": [] }, { "id": 334, "joke": "Chuck Norris qualified with a top speed of 324 mph at the Daytona 500, without a car.", "categories": [] }, { "id": 318, "joke": "If you work in an office with Chuck Norris, don't ask him for his three-hole-punch.", "categories": [] }, { "id": 30, "joke": "Someone once tried to tell Chuck Norris that roundhouse kicks aren't the best way to kick someone. This has been recorded by historians as the worst mistake anyone has ever made.", "categories": [] }, { "id": 238, "joke": "Chuck Norris once went skydiving, but promised never to do it again. One Grand Canyon is enough.", "categories": [] }, { "id": 558, "joke": "Chuck Norris never has to build his program to machine code. Machines have learnt to interpret Chuck Norris code.", "categories": ["nerdy"] }, { "id": 584, "joke": "Only Chuck Norris shuts down websites without due process, not SOPA or PIPA.", "categories": ["nerdy"] }, { "id": 78, "joke": "The grass is always greener on the other side, unless Chuck Norris has been there. In that case the grass is most likely soaked in blood and tears.", "categories": [] }, { "id": 421, "joke": "Chuck Norris is not Politically Correct. He is just Correct. Always.", "categories": [] }, { "id": 548, "joke": "Product Owners never argue with Chuck Norris after he demonstrates the DropKick feature.", "categories": ["nerdy"] }, { "id": 411, "joke": "The pen is mightier than the sword, but only if the pen is held by Chuck Norris.", "categories": [] }, { "id": 458, "joke": "Chuck Norris can write infinite recursion functions and have them return.", "categories": ["nerdy"] }, { "id": 249, "joke": "Maslow's theory of higher needs does not apply to Chuck Norris. He only has two needs: killing people and finding people to kill.", "categories": [] }, { "id": 413, "joke": "Those aren't credits that roll after Walker Texas Ranger. It is actually a list of fatalities that occurred during the making of the episode.", "categories": [] }, { "id": 222, "joke": "Industrial logging isn't the cause of deforestation. Chuck Norris needs toothpicks.", "categories": [] }, { "id": 299, "joke": "Jack Bauer tried to use his detailed knowledge of torture techniques, but to no avail: Chuck Norris thrives on pain. Chuck Norris then ripped off Jack Bauer's arm and beat him to death with it. Game, set, match.", "categories": [] }, { "id": 270, "joke": "The phrase 'dead ringer' refers to someone who sits behind Chuck Norris in a movie theater and forgets to turn their cell phone off.", "categories": [] }, { "id": 398, "joke": "Chuck Norris is not Irish. His hair is soaked in the blood of his victims.", "categories": [] }, { "id": 333, "joke": "Chuck Norris was banned from competitive bullriding after a 1992 exhibition in San Antonio, when he rode the bull 1,346 miles from Texas to Milwaukee Wisconsin to pick up his dry cleaning.", "categories": [] }, { "id": 94, "joke": "Chuck Norris has the greatest Poker-Face of all time. He won the 1983 World Series of Poker, despite holding only a Joker, a Get out of Jail Free Monopoly card, a 2 of clubs, 7 of spades and a green #4 card from the game UNO.", "categories": [] }, { "id": 593, "joke": "Chuck Norris can watch the radio.", "categories": [] }, { "id": 427, "joke": "Chuck Norris' favorite cereal is Kellogg's Nails 'N' Gravel.", "categories": [] }, { "id": 617, "joke": "Chuck Norris doesn't turn on his faucet, he stares at it until it cries.", "categories": [] }, { "id": 506, "joke": "Chuck Norris programs do not accept input.", "categories": ["nerdy"] }, { "id": 140, "joke": "Chuck Norris built a better mousetrap, but the world was too frightened to beat a path to his door.", "categories": [] }, { "id": 133, "joke": "Chuck Norris doesn't stub his toes. He accidentally destroys chairs, bedframes, and sidewalks.", "categories": [] }, { "id": 271, "joke": "Staring at Chuck Norris for extended periods of time without proper eye protection will cause blindess, and possibly foot sized brusies on the face.", "categories": [] }, { "id": 80, "joke": "Newton's Third Law is wrong: Although it states that for each action, there is an equal and opposite reaction, there is no force equal in reaction to a Chuck Norris roundhouse kick.", "categories": [] }, { "id": 95, "joke": "On his birthday, Chuck Norris randomly selects one lucky child to be thrown into the sun.", "categories": [] }, { "id": 117, "joke": "James Cameron wanted Chuck Norris to play the Terminator. However, upon reflection, he realized that would have turned his movie into a documentary, so he went with Arnold Schwarzenegger.", "categories": [] }, { "id": 308, "joke": "When you say &quot;no one's perfect&quot;, Chuck Norris takes this as a personal insult.", "categories": [] }, { "id": 189, "joke": "Behind every successful man, there is a woman. Behind every dead man, there is Chuck Norris.", "categories": [] }, { "id": 220, "joke": "It is better to give than to receive. This is especially true of a Chuck Norris roundhouse kick.", "categories": [] }, { "id": 369, "joke": "A movie scene depicting Chuck Norris losing a fight with Bruce Lee was the product of history's most expensive visual effect. When adjusted for inflation, the effect cost more than the Gross National Product of Paraguay.", "categories": [] }, { "id": 408, "joke": "Love does not hurt. Chuck Norris does.", "categories": [] }, { "id": 470, "joke": "Chuck Norris doesn't bug hunt as that signifies a probability of failure, he goes bug killing.", "categories": ["nerdy"] }, { "id": 69, "joke": "Scientists have estimated that the energy given off during the Big Bang is roughly equal to 1CNRhK (Chuck Norris Roundhouse Kick).", "categories": ["nerdy"] }, { "id": 594, "joke": "Chuck Norris built the hospital he was born in.", "categories": [] }, { "id": 310, "joke": "182,000 Americans die from Chuck Norris-related accidents every year.", "categories": [] }, { "id": 441, "joke": "Chuck Norris did not &quot;lose&quot; his virginity, he stalked it and then destroyed it with extreme prejudice.", "categories": [] }, { "id": 377, "joke": "When Arnold says &quot;I'll be back&quot; in Terminator movie it is implied that he's going to ask Chuck Norris for help.", "categories": [] }, { "id": 128, "joke": "A high tide means Chuck Norris is flying over your coast. The tide is caused by God pissing his pants.", "categories": [] }, { "id": 14, "joke": "There are no steroids in baseball. Just players Chuck Norris has breathed on.", "categories": [] }, { "id": 522, "joke": "Chuck Norris can do a wheelie on a unicycle.", "categories": [] }, { "id": 603, "joke": "Ghosts are actually caused by Chuck Norris killing people faster than Death can process them.", "categories": [] }, { "id": 237, "joke": "Human cloning is outlawed because of Chuck Norris, because then it would be possible for a Chuck Norris roundhouse kick to meet another Chuck Norris roundhouse kick. Physicists theorize that this contact would end the universe.", "categories": [] }, { "id": 290, "joke": "There are two types of people in the world... people that suck, and Chuck Norris.", "categories": [] }, { "id": 306, "joke": "Scientifically speaking, it is impossible to charge Chuck Norris with &quot;obstruction of justice.&quot; This is because even Chuck Norris cannot be in two places at the same time.", "categories": [] }, { "id": 277, "joke": "Chuck Norris can blow bubbles with beef jerky.", "categories": [] }, { "id": 384, "joke": "Chuck Norris was the orginal sculptor of Mount Rushmore. He completed the entire project using only a bottle opener and a drywall trowel.", "categories": [] }, { "id": 515, "joke": "Chuck Norris compresses his files by doing a flying round house kick to the hard drive.", "categories": ["nerdy"] }, { "id": 2, "joke": "MacGyver can build an airplane out of gum and paper clips. Chuck Norris can kill him and take it.", "categories": [] }, { "id": 105, "joke": "Chuck Norris can drink an entire gallon of milk in thirty-seven seconds.", "categories": [] }, { "id": 537, "joke": "Each hair in Chuck Norris's beard contributes to make the world's largest DDOS.", "categories": ["nerdy"] }, { "id": 212, "joke": "Chuck Norris does not play the lottery. It doesn't have nearly enough balls.", "categories": [] }, { "id": 298, "joke": "MacGyver immediately tried to make a bomb out of some Q-Tips and Gatorade, but Chuck Norris roundhouse-kicked him in the solar plexus. MacGyver promptly threw up his own heart.", "categories": [] }, { "id": 479, "joke": "Chuck Norris does not need to know about class factory pattern. He can instantiate interfaces.", "categories": ["nerdy"] }, { "id": 490, "joke": "Chuck Norris doesn't need to use AJAX because pages are too afraid to postback anyways.", "categories": ["nerdy"] }, { "id": 389, "joke": "Chuck Norris has banned rainbows from the state of North Dakota.", "categories": [] }, { "id": 478, "joke": "Chuck Norris can instantiate an abstract class.", "categories": ["nerdy"] } ]
